# GetPosition Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarBendingDetail..::..GetPosition Method
RebarBendingDetail Class See Also
---
Gets the position of the bending detail relative to its view.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static XYZ GetPosition(
	Element bendingDetail
)
```

Visual Basic
---
```text
Public Shared Function GetPosition ( _
	bendingDetail As Element _
) As XYZ
```

Visual C++
---
```text
public:
static XYZ^ GetPosition(
	Element^ bendingDetail
)
```

# ### Parameters
bendingDetail
    Type: Autodesk.Revit.DB..::..Element The bending detail for which we want to get the position.
# ### Return Value
Returns the position of the bending detail relative to its view.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RebarBendingDetail Class
Autodesk.Revit.DB.Structure Namespace